README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-10-10 Thu 14:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mini-projet d'initiation à Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Mini-projet d'initiation à Java</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgddbfce6">1. Contexte</a></li>
<li><a href="#org4d00904">2. MVP</a></li>
<li><a href="#orgd89ccd6">3. Objectif</a></li>
<li><a href="#orgc63f3b9">4. Prétraitements</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgddbfce6" class="outline-2">
<h2 id="orgddbfce6"><span class="section-number-2">1</span> Contexte</h2>
<div class="outline-text-2" id="text-1">
<p>
Le programme doit permettre de travailler sur un ensemble de fichiers
texte correspondant à des livres. On voudra pouvoir avoir des
informations sur le contenu des ces livres.
</p>
</div>
</div>

<div id="outline-container-org4d00904" class="outline-2">
<h2 id="org4d00904"><span class="section-number-2">2</span> MVP</h2>
<div class="outline-text-2" id="text-2">
<p>
Le programme doit accepter un nombre quelconque d'arguments qui sont
des noms de fichiers. Ensuite, il doit présenter le menu suivant :
</p>

<div class="VERBATIM">
<ol class="org-ol">
<li>Lister les fichiers</li>
<li>Ajouter un fichier</li>
<li>Supprimer un fichier</li>
<li>Afficher des informations sur un livre</li>
<li>Quitter le programme</li>
</ol>

</div>


<p>
Pendant toute l'exécution du programme, celui-ci maintient une liste
des noms de fichiers, initialisée par les arguments du programme,
qu'il est possible de consulter et modifier avec les trois premières
options.
</p>

<p>
Le quatrième choix :
</p>
<ol class="org-ol">
<li>affiche la liste des fichiers</li>
<li>propose de choisir d'un de ces fichiers</li>
<li>propose le sous-menu suivant :</li>
</ol>
<div class="VERBATIM">
<ol class="org-ol">
<li>Afficher le nombre de lignes du fichier</li>
<li>Afficher le nombre de mots du fichier</li>
</ol>

</div>
</div>
</div>

<div id="outline-container-orgd89ccd6" class="outline-2">
<h2 id="orgd89ccd6"><span class="section-number-2">3</span> Objectif</h2>
<div class="outline-text-2" id="text-3">
<p>
Parmi les informations proposées pour un fichier, ajouter :
</p>
<ul class="org-ul">
<li>afficher les 50 mots les plus fréquents et leur nombre d'occurrences</li>
<li>afficher les mots qui sont présents seulement dans ce fichier et
aucun des autres fichiers</li>
<li>Afficher pour chacun des autres fichiers le pourcentage de mots de
l'autre fichier qui sont présents dans le fichier sélectionnés, par
ordre décroissant de ce pourcentage.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc63f3b9" class="outline-2">
<h2 id="orgc63f3b9"><span class="section-number-2">4</span> Prétraitements</h2>
<div class="outline-text-2" id="text-4">
<p>
Les fichiers de texte contiennent, en plus des mots, des signes,
notamment de ponctuation, qu'on voudra éliminer. Pour faciliter le
mini-projet, on peut le faire avec un prétraitement, par exemple en
utilisant le programme suivant pour générer des fichiers ne contenant
que les mots (un par ligne), d'un fichier texte :
</p>


<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileNotFoundException</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">File</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileOutputStream</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">PrintStream</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Scanner</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">regex</span>.<span style="color: #6434A3;">Matcher</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #D0372D;">regex</span>.<span style="color: #6434A3;">Pattern</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">BooksToWords</span> {
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>)<span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">FileNotFoundException</span> {
        <span style="color: #6434A3;">Pattern</span> <span style="color: #BA36A5;">p</span> = Pattern.compile(<span style="color: #008000;">"\\w+"</span>, <span style="color: #D0372D;">Pattern</span>.UNICODE_CHARACTER_CLASS);
        <span style="color: #0000FF;">try</span>(<span style="color: #6434A3;">Scanner</span> <span style="color: #BA36A5;">sc</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Scanner</span>(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">File</span>(args[0]));
            <span style="color: #6434A3;">PrintStream</span> <span style="color: #BA36A5;">fileOut</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">PrintStream</span>(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileOutputStream</span>(args[1]))){
            <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>=0; sc.hasNextLine(); ++i){
                <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">Matcher</span> <span style="color: #BA36A5;">m1</span> = p.matcher(sc.nextLine()); m1.find();) {
                    fileOut.println(m1.group());
                }
            }
        }
    }
}
</pre>
</div>

<p>
On peut aussi réaliser ce programme en python :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> sys
<span style="color: #0000FF;">import</span> re
<span style="color: #0000FF;">with</span> <span style="color: #006FE0;">open</span>(sys.argv[1]) <span style="color: #0000FF;">as</span> <span style="color: #006FE0;">input</span>, <span style="color: #006FE0;">open</span>(sys.argv[2], <span style="color: #008000;">"w"</span>) <span style="color: #0000FF;">as</span> output:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">for</span> line <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">input</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">for</span> word <span style="color: #0000FF;">in</span> re.findall(r<span style="color: #008000;">'\w+'</span>, line):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   output.write(word.lower())
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   output.write(<span style="color: #008000;">'\n'</span>)
</pre>
</div>

<p>
Si vous le voulez, vous pouvez vous inspirer de ce code pour que votre
programme puisse traiter directement les fichiers de texte en
réalisant vous-même l'extraction des mots.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Bernard Hugueney</p>
<p class="date">Created: 2019-10-10 Thu 14:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
